In [2]:
import pandas as pd
import numpy as np

In [3]:
df1 = pd.read_csv("combined_sale.csv")

In [17]:
df = df1.copy()

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 186850 entries, 0 to 186849
Data columns (total 7 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Order ID          186305 non-null  object
 1   Product           186305 non-null  object
 2   Quantity Ordered  186305 non-null  object
 3   Price Each        186305 non-null  object
 4   Order Date        186305 non-null  object
 5   Purchase Address  186305 non-null  object
 6   Month             186850 non-null  object
dtypes: object(7)
memory usage: 10.0+ MB

In [6]:
df.head(8)

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Month
0,150502,iPhone,1,700,02/18/19 01:35,"866 Spruce St, Portland, ME 04101",February
1,150503,AA Batteries (4-pack),1,3.84,02/13/19 07:24,"18 13th St, San Francisco, CA 94016",February
2,150504,27in 4K Gaming Monitor,1,389.99,02/18/19 09:46,"52 6th St, New York City, NY 10001",February
3,150505,Lightning Charging Cable,1,14.95,02/02/19 16:47,"129 Cherry St, Atlanta, GA 30301",February
4,150506,AA Batteries (4-pack),2,3.84,02/28/19 20:32,"548 Lincoln St, Seattle, WA 98101",February
5,150507,Lightning Charging Cable,1,14.95,02/24/19 18:50,"387 12th St, Austin, TX 73301",February
6,150508,AA Batteries (4-pack),1,3.84,02/21/19 19:26,"622 Center St, San Francisco, CA 94016",February
7,150509,Apple Airpods Headphones,1,150,02/26/19 19:53,"921 6th St, Seattle, WA 98101",February

In [26]:
# Using errors='coerce' to handle problematic entries gracefully
df['Order Date'] = pd.to_datetime(df['Order Date'], errors='coerce')

/var/folders/39/wyrxl9f95kd_tw3vzwk1slt80000gn/T/ipykernel_7708/306799121.py:2: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df['Order Date'] = pd.to_datetime(df['Order Date'], errors='coerce')

In [9]:
df.tail(8)

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Month
186842,278789,Wired Headphones,1,11.99,2019-10-22 08:52:00,"617 Walnut St, Boston, MA 02215",October
186843,278790,USB-C Charging Cable,1,11.95,2019-10-26 10:58:00,"181 8th St, Boston, MA 02215",October
186844,278791,AAA Batteries (4-pack),1,2.99,2019-10-18 13:08:00,"537 Hill St, San Francisco, CA 94016",October
186845,278792,AA Batteries (4-pack),1,3.84,2019-10-12 04:32:00,"920 Adams St, San Francisco, CA 94016",October
186846,278793,Wired Headphones,1,11.99,2019-10-28 22:00:00,"161 Chestnut St, Los Angeles, CA 90001",October
186847,278794,AA Batteries (4-pack),1,3.84,2019-10-09 20:58:00,"346 Spruce St, San Francisco, CA 94016",October
186848,278795,iPhone,1,700,2019-10-31 17:21:00,"291 Hill St, Seattle, WA 98101",October
186849,278796,Wired Headphones,1,11.99,2019-10-13 11:20:00,"547 Jefferson St, Los Angeles, CA 90001",October

In [15]:
df.dropna(subset=['Order ID'], inplace=True)

In [16]:
df.isna().sum()

Order ID              0
Product               0
Quantity Ordered      0
Price Each            0
Order Date          355
Purchase Address      0
Month                 0
dtype: int64

In [22]:
df[df["Order Date"].isna() ==  True]

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Month
75,NaN,NaN,NaN,NaN,NaN,NaN,February
169,NaN,NaN,NaN,NaN,NaN,NaN,February
172,NaN,NaN,NaN,NaN,NaN,NaN,February
1488,NaN,NaN,NaN,NaN,NaN,NaN,February
1517,NaN,NaN,NaN,NaN,NaN,NaN,February
...,...,...,...,...,...,...,...
184390,NaN,NaN,NaN,NaN,NaN,NaN,October
184779,NaN,NaN,NaN,NaN,NaN,NaN,October
185239,NaN,NaN,NaN,NaN,NaN,NaN,October
185614,NaN,NaN,NaN,NaN,NaN,NaN,October
185993,NaN,NaN,NaN,NaN,NaN,NaN,October

In [23]:

df.dropna(subset=['Order Date'], inplace=True)

In [24]:
df.isna().sum()

Order ID            0
Product             0
Quantity Ordered    0
Price Each          0
Order Date          0
Purchase Address    0
Month               0
dtype: int64

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 186305 entries, 0 to 186849
Data columns (total 7 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Order ID          186305 non-null  object
 1   Product           186305 non-null  object
 2   Quantity Ordered  186305 non-null  object
 3   Price Each        186305 non-null  object
 4   Order Date        185950 non-null  datetime64[ns]
 5   Purchase Address  186305 non-null  object
 6   Month             186305 non-null  object
dtypes: datetime64[ns](1), object(6)
memory usage: 11.4+ MB

In [35]:
import pyarrow

In [ ]:
# sometime there are repeated headers so check them and remove them
df[df['Price Each'] == 'Price Each']

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Month
1483,Order ID,Product,Quantity Ordered,Price Each,NaT,Purchase Address,February
1904,Order ID,Product,Quantity Ordered,Price Each,NaT,Purchase Address,February
2050,Order ID,Product,Quantity Ordered,Price Each,NaT,Purchase Address,February
2225,Order ID,Product,Quantity Ordered,Price Each,NaT,Purchase Address,February
3091,Order ID,Product,Quantity Ordered,Price Each,NaT,Purchase Address,February
...,...,...,...,...,...,...,...
184502,Order ID,Product,Quantity Ordered,Price Each,NaT,Purchase Address,October
184542,Order ID,Product,Quantity Ordered,Price Each,NaT,Purchase Address,October
185088,Order ID,Product,Quantity Ordered,Price Each,NaT,Purchase Address,October
185359,Order ID,Product,Quantity Ordered,Price Each,NaT,Purchase Address,October
186774,Order ID,Product,Quantity Ordered,Price Each,NaT,Purchase Address,October

In [39]:
df = df[df['Order ID'] != 'Order ID']

In [40]:
df['Price Each'] = df['Price Each'].astype('float64[pyarrow]')

In [42]:
df['Quantity Ordered'] = df['Quantity Ordered'].astype('Int64')

In [43]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 185950 entries, 0 to 186849
Data columns (total 7 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Order ID          185950 non-null  object
 1   Product           185950 non-null  object
 2   Quantity Ordered  185950 non-null  Int64
 3   Price Each        185950 non-null  double[pyarrow]
 4   Order Date        185950 non-null  datetime64[ns]
 5   Purchase Address  185950 non-null  object
 6   Month             185950 non-null  object
dtypes: Int64(1), datetime64[ns](1), double[pyarrow](1), object(4)
memory usage: 11.5+ MB

In [44]:
df.columns

Index(['Order ID', 'Product', 'Quantity Ordered', 'Price Each', 'Order Date',
       'Purchase Address', 'Month'],
      dtype='object')

In [49]:
# Convert columns to standard float types
df['Quantity Ordered'] = pd.to_numeric(df['Quantity Ordered'], errors='coerce').astype(float)
df['Price Each'] = pd.to_numeric(df['Price Each'], errors='coerce').astype(float)

# Create Revenue column
df['Revenue'] = df['Quantity Ordered'] * df['Price Each']

In [50]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 185950 entries, 0 to 186849
Data columns (total 8 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Order ID          185950 non-null  object
 1   Product           185950 non-null  object
 2   Quantity Ordered  185950 non-null  float64
 3   Price Each        185950 non-null  float64
 4   Order Date        185950 non-null  datetime64[ns]
 5   Purchase Address  185950 non-null  object
 6   Month             185950 non-null  object
 7   Revenue           185950 non-null  float64
dtypes: datetime64[ns](1), float64(3), object(4)
memory usage: 12.8+ MB

In [ ]:
df["Year"] = df["Order Date"].dt.year
df["Month"] = df["Order Date"].dt.month
df["Month_Name"] = df["Order Date"].dt.strftime("%B")

KeyError: 'Order Date'

In [56]:
df.head(8)

,Order ID,Product,Quantity,Price Each,Date,Purchase Address,Month,Revenue,Year,Month_Name
0,150502,iPhone,1.0,700.00,2019-02-18 01:35:00,"866 Spruce St, Portland, ME 04101",2,700.00,2019,February
1,150503,AA Batteries (4-pack),1.0,3.84,2019-02-13 07:24:00,"18 13th St, San Francisco, CA 94016",2,3.84,2019,February
2,150504,27in 4K Gaming Monitor,1.0,389.99,2019-02-18 09:46:00,"52 6th St, New York City, NY 10001",2,389.99,2019,February
3,150505,Lightning Charging Cable,1.0,14.95,2019-02-02 16:47:00,"129 Cherry St, Atlanta, GA 30301",2,14.95,2019,February
4,150506,AA Batteries (4-pack),2.0,3.84,2019-02-28 20:32:00,"548 Lincoln St, Seattle, WA 98101",2,7.68,2019,February
5,150507,Lightning Charging Cable,1.0,14.95,2019-02-24 18:50:00,"387 12th St, Austin, TX 73301",2,14.95,2019,February
6,150508,AA Batteries (4-pack),1.0,3.84,2019-02-21 19:26:00,"622 Center St, San Francisco, CA 94016",2,3.84,2019,February
7,150509,Apple Airpods Headphones,1.0,150.00,2019-02-26 19:53:00,"921 6th St, Seattle, WA 98101",2,150.00,2019,February

In [54]:
df = df.rename(columns={"Order Date": "Date"})
df = df.rename(columns = {"Quantity Ordered": "Quantity"})

In [55]:
total_revenue = df["Revenue"].sum()
total_quantity = df["Quantity"].sum()

In [59]:
df["Year_Month"] = df["Date"].dt.to_period("M")

In [60]:
monthly_kpi = df.groupby("Year_Month").agg({
    "Revenue": "sum",
    "Quantity": "sum",
    "Order ID": "nunique"
}).reset_index()

monthly_kpi.rename(columns={
    "Order ID": "Total_Orders"
}, inplace=True)

In [63]:
monthly_kpi.head(12)

,Year_Month,Revenue,Quantity,Total_Orders,Average_Order_Value,Revenue_Growth_%,Order_Growth_%
0,2019-01,1813586.44,10862.0,9262,195.809376,NaN,NaN
1,2019-02,2202022.42,13449.0,11496,191.546835,21.418112,24.120060
2,2019-03,2807100.38,17005.0,14549,192.941122,27.478283,26.557063
3,2019-04,3390670.24,20558.0,17528,193.443076,20.789063,20.475634
4,2019-05,3152606.75,18667.0,15836,199.078476,-7.021134,-9.653126
5,2019-06,2577802.26,15253.0,12989,198.460410,-18.232673,-17.978025
6,2019-07,2647775.76,16072.0,13761,192.411581,2.714463,5.943491
7,2019-08,2244467.88,13448.0,11484,195.443041,-15.231950,-16.546763
8,2019-09,2097560.13,13109.0,11202,187.248717,-6.545326,-2.455590
9,2019-10,3736726.88,22703.0,19436,192.258020,78.146353,73.504731
10,2019-11,3199603.20,19798.0,16859,189.786061,-14.374176,-13.258901
11,2019-12,4613443.34,28114.0,24004,192.194773,44.187984,42.380924

In [62]:
monthly_kpi["Average_Order_Value"] = (
    monthly_kpi["Revenue"] / monthly_kpi["Total_Orders"]
)

monthly_kpi["Revenue_Growth_%"] = (
    monthly_kpi["Revenue"].pct_change() * 100
)

monthly_kpi["Order_Growth_%"] = (
    monthly_kpi["Total_Orders"].pct_change() * 100
)

In [64]:
monthly_kpi.head()

,Year_Month,Revenue,Quantity,Total_Orders,Average_Order_Value,Revenue_Growth_%,Order_Growth_%
0,2019-01,1813586.44,10862.0,9262,195.809376,NaN,NaN
1,2019-02,2202022.42,13449.0,11496,191.546835,21.418112,24.120060
2,2019-03,2807100.38,17005.0,14549,192.941122,27.478283,26.557063
3,2019-04,3390670.24,20558.0,17528,193.443076,20.789063,20.475634
4,2019-05,3152606.75,18667.0,15836,199.078476,-7.021134,-9.653126

In [65]:
monthly_kpi.fillna(0, inplace=True)

In [94]:
monthly_kpi.head(13)

,Year_Month,Revenue,Quantity,Total_Orders,Average_Order_Value,Revenue_Growth_%,Order_Growth_%,Decline
0,2019-01,1813586.44,10862.0,9262,195.809376,0.000000,0.000000,False
1,2019-02,2202022.42,13449.0,11496,191.546835,21.418112,24.120060,False
2,2019-03,2807100.38,17005.0,14549,192.941122,27.478283,26.557063,False
3,2019-04,3390670.24,20558.0,17528,193.443076,20.789063,20.475634,False
4,2019-05,3152606.75,18667.0,15836,199.078476,-7.021134,-9.653126,True
5,2019-06,2577802.26,15253.0,12989,198.460410,-18.232673,-17.978025,True
6,2019-07,2647775.76,16072.0,13761,192.411581,2.714463,5.943491,False
7,2019-08,2244467.88,13448.0,11484,195.443041,-15.231950,-16.546763,True
8,2019-09,2097560.13,13109.0,11202,187.248717,-6.545326,-2.455590,True
9,2019-10,3736726.88,22703.0,19436,192.258020,78.146353,73.504731,False
10,2019-11,3199603.20,19798.0,16859,189.786061,-14.374176,-13.258901,True
11,2019-12,4613443.34,28114.0,24004,192.194773,44.187984,42.380924,False
12,2020-01,8670.29,41.0,31,279.686774,-99.812065,-99.870855,True

In [70]:
product_kpi = df.groupby("Product").agg({
    "Revenue": "sum",
    "Quantity": "sum",
    "Order ID": "nunique"
}).reset_index()

product_kpi.rename(columns={
    "Order ID": "Total_Orders"
}, inplace=True)

product_kpi = product_kpi.sort_values("Revenue", ascending=False)

In [75]:
product_kpi.head()

                   Product     Revenue  Quantity  Total_Orders
13      Macbook Pro Laptop  8037600.00    4728.0          4721
18                  iPhone  4794300.00    6849.0          6840
14         ThinkPad Laptop  4129958.70    4130.0          4126
9             Google Phone  3319200.00    5532.0          5522
1   27in 4K Gaming Monitor  2435097.56    6244.0          6225

In [76]:
total_revenue = product_kpi["Revenue"].sum()

product_kpi["Revenue_%"] = (
    product_kpi["Revenue"] / total_revenue * 100
)

In [77]:
product_kpi.head()

                   Product     Revenue  Quantity  Total_Orders  Revenue_%
13      Macbook Pro Laptop  8037600.00    4728.0          4721  23.302771
18                  iPhone  4794300.00    6849.0          6840  13.899730
14         ThinkPad Laptop  4129958.70    4130.0          4126  11.973659
9             Google Phone  3319200.00    5532.0          5522   9.623091
1   27in 4K Gaming Monitor  2435097.56    6244.0          6225   7.059884

In [83]:
concentration_risk = product_kpi["Revenue_%"].max() > 40

In [78]:
monthly_kpi["Decline"] = monthly_kpi["Revenue"].diff() < 0

two_month_decline = (
    monthly_kpi["Decline"].rolling(2).sum().max() == 2
)

In [79]:
growth_slowing = (
    monthly_kpi["Revenue_Growth_%"].diff() < 0
).sum() >= 2

In [82]:
monthly_kpi.head(12)

,Year_Month,Revenue,Quantity,Total_Orders,Average_Order_Value,Revenue_Growth_%,Order_Growth_%,Decline
0,2019-01,1813586.44,10862.0,9262,195.809376,0.000000,0.000000,False
1,2019-02,2202022.42,13449.0,11496,191.546835,21.418112,24.120060,False
2,2019-03,2807100.38,17005.0,14549,192.941122,27.478283,26.557063,False
3,2019-04,3390670.24,20558.0,17528,193.443076,20.789063,20.475634,False
4,2019-05,3152606.75,18667.0,15836,199.078476,-7.021134,-9.653126,True
5,2019-06,2577802.26,15253.0,12989,198.460410,-18.232673,-17.978025,True
6,2019-07,2647775.76,16072.0,13761,192.411581,2.714463,5.943491,False
7,2019-08,2244467.88,13448.0,11484,195.443041,-15.231950,-16.546763,True
8,2019-09,2097560.13,13109.0,11202,187.248717,-6.545326,-2.455590,True
9,2019-10,3736726.88,22703.0,19436,192.258020,78.146353,73.504731,False
10,2019-11,3199603.20,19798.0,16859,189.786061,-14.374176,-13.258901,True
11,2019-12,4613443.34,28114.0,24004,192.194773,44.187984,42.380924,False

In [84]:
print("Concentration Risk:", concentration_risk)

Concentration Risk: False

In [86]:
df.to_csv("sales_data.csv", index=False)

In [91]:
df2 = pd.read_csv("../sales_data.csv")

In [92]:
df2.head()

,Order ID,Product,Quantity,Price Each,Date,Purchase Address,Month,Revenue,Year,Month_Name,Year_Month
0,150502,iPhone,1.0,700.00,2019-02-18 01:35:00,"866 Spruce St, Portland, ME 04101",2,700.00,2019,February,2019-02
1,150503,AA Batteries (4-pack),1.0,3.84,2019-02-13 07:24:00,"18 13th St, San Francisco, CA 94016",2,3.84,2019,February,2019-02
2,150504,27in 4K Gaming Monitor,1.0,389.99,2019-02-18 09:46:00,"52 6th St, New York City, NY 10001",2,389.99,2019,February,2019-02
3,150505,Lightning Charging Cable,1.0,14.95,2019-02-02 16:47:00,"129 Cherry St, Atlanta, GA 30301",2,14.95,2019,February,2019-02
4,150506,AA Batteries (4-pack),2.0,3.84,2019-02-28 20:32:00,"548 Lincoln St, Seattle, WA 98101",2,7.68,2019,February,2019-02

In [93]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 185950 entries, 0 to 185949
Data columns (total 11 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Order ID          185950 non-null  int64
 1   Product           185950 non-null  object
 2   Quantity          185950 non-null  float64
 3   Price Each        185950 non-null  float64
 4   Date              185950 non-null  object
 5   Purchase Address  185950 non-null  object
 6   Month             185950 non-null  int64
 7   Revenue           185950 non-null  float64
 8   Year              185950 non-null  int64
 9   Month_Name        185950 non-null  object
 10  Year_Month        185950 non-null  object
dtypes: float64(3), int64(3), object(5)
memory usage: 15.6+ MB